---
kind: method
id: M:Autodesk.Revit.UI.RadioButtonGroupData.#ctor(System.String)
source: html/ed62ab14-cdb8-734f-b1f5-ddeb7c8da695.htm
---
# Autodesk.Revit.UI.RadioButtonGroupData.#ctor Method

Constructs a new instance of RadioButtonGroupData.

## Syntax (C#)
```csharp
public RadioButtonGroupData(
	string name
)
```

## Parameters
- **name** (`System.String`) - The internal name of the RadioButtonGroup.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - Thrown when Nothing nullptr a null reference ( Nothing in Visual Basic) is passed for name.
- **Autodesk.Revit.Exceptions.ArgumentException** - Thrown when an empty string is passed for name.